In [2]:
import pandas as pd

file_path = '../datasource/user.csv'

In [5]:
df = pd.read_csv(file_path, encoding="gbk",header=None,names=['s','c',''])

df.head(10)

     id name  age
0  1001   毛毛   45
1  1002   张三   15
2  1003   李四   10
3  1004   王五   21
4  1005   周六   33
5  1006   孙七   11

In [4]:
df.shape

(6, 3)

In [13]:
df.columns

'age'

In [16]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [18]:
df.dtypes

id       int64
name    object
age      int64
dtype: object

## series

In [5]:
s = pd.Series({ 'name':'maomao', 'age':12,  })
s.values

array(['maomao', 12], dtype=object)

In [7]:
s = pd.Series(['a','b','c','d'],index=['甲','乙','丙','丁'])
s

甲    a
乙    b
丙    c
丁    d
dtype: object

In [8]:
s[['甲','乙']]

甲    a
乙    b
dtype: object

## DataFrame
### 1、创建

In [13]:
df = pd.DataFrame({
    'name':[ 'tom','john','jack','bob' ],
    'age':[10,12,45,55,],
    'gender':[0,1,1,0]
})
df

   name  age  gender
0   tom   10       0
1  john   12       1
2  jack   45       1
3   bob   55       0

### 2、 查询列

In [15]:
df[['name','age']]

   name  age
0   tom   10
1  john   12
2  jack   45
3   bob   55

### 3、查询行
* loc[0:2] ：index 0和1，不包括2

In [16]:
df.loc[0]

name      tom
age        10
gender      0
Name: 0, dtype: object

In [23]:
df[1:3]

   name  age  gender
1  john   12       1
2  jack   45       1